# üõí E-Commerce SQL Practice (Beginner Level)

Welcome! This notebook contains **12 easy practice questions** to help you learn SQL basics.

## üìå Tips for Beginners
- SQL is not case-sensitive, but we use UPPERCASE for SQL keywords
- Always end your queries (optional in this notebook, but good practice)
- Read each question carefully before writing your query

---

## üì¶ Setup: Connect to Database

Run the cells below first to set up the database.

In [9]:
# Import libraries and connect to database
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect('ecommerce.db')

# Helper function - just use run_query("YOUR SQL HERE")
def run_query(query):
    return pd.read_sql_query(query, conn)

print("‚úÖ Ready! You can now use run_query() to run SQL queries.")

‚úÖ Ready! You can now use run_query() to run SQL queries.

## üìä Database Tables

We have these tables in our e-commerce database:

| Table Name | What It Contains |
|------------|------------------|
| `customers` | Customer info (name, email, city) |
| `products` | Products for sale (name, price) |
| `categories` | Product categories |
| `orders` | Customer orders |
| `order_items` | Items in each order |
| `payments` | Payment records |

Let's look at some sample data:

In [10]:
# See what's in the customers table
print("üë• CUSTOMERS TABLE:")
run_query("SELECT * FROM customers LIMIT 5")

üë• CUSTOMERS TABLE:

,customer_id,first_name,last_name,email,phone,address,city,country,registration_date
0,1,John,Smith,john.smith@email.com,555-0101,123 Main St,New York,USA,2023-01-15
1,2,Emily,Johnson,emily.j@email.com,555-0102,456 Oak Ave,Los Angeles,USA,2023-02-20
2,3,Michael,Williams,mwilliams@email.com,555-0103,789 Pine Rd,Chicago,USA,2023-03-10
3,4,Sarah,Brown,sarah.b@email.com,555-0104,321 Elm St,Houston,USA,2023-04-05
4,5,David,Jones,djones@email.com,555-0105,654 Maple Dr,Phoenix,USA,2023-05-12

In [11]:
# See what's in the products table
print("üì¶ PRODUCTS TABLE:")
run_query("SELECT * FROM products LIMIT 5")

üì¶ PRODUCTS TABLE:

,product_id,product_name,category_id,price,stock_quantity,description
0,1,iPhone 15 Pro,1,999.99,50,Latest Apple smartphone
1,2,Samsung Galaxy S24,1,899.99,45,Premium Android phone
2,3,MacBook Air M3,1,1299.99,30,Apple laptop with M3 chip
3,4,AirPods Pro 2,1,249.99,100,Wireless earbuds
4,5,Nike Air Max,2,129.99,80,Running shoes

In [12]:
# See what's in the orders table
print("üõçÔ∏è ORDERS TABLE:")
run_query("SELECT * FROM orders LIMIT 5")

üõçÔ∏è ORDERS TABLE:

,order_id,customer_id,order_date,status,shipping_address,total_amount
0,1,1,2024-01-05 10:30:00,completed,"123 Main St, New York",1249.98
1,2,2,2024-01-07 14:15:00,completed,"456 Oak Ave, Los Angeles",899.99
2,3,3,2024-01-10 09:45:00,completed,"789 Pine Rd, Chicago",179.98
3,4,1,2024-01-12 16:20:00,completed,"123 Main St, New York",249.99
4,5,4,2024-01-15 11:00:00,shipped,"321 Elm St, Houston",1549.98

---

# üìù Practice Questions (Easy Level)

---

## Question 1: SELECT All Columns

**Show all data from the `categories` table.**

üí° **Hint:** Use `SELECT * FROM table_name`

In [ ]:
# YOUR CODE HERE
run_query("""
SELECT * FROM categories LIMIT 5
""")

,customer_id,first_name,last_name,email,phone,address,city,country,registration_date
0,1,John,Smith,john.smith@email.com,555-0101,123 Main St,New York,USA,2023-01-15
1,2,Emily,Johnson,emily.j@email.com,555-0102,456 Oak Ave,Los Angeles,USA,2023-02-20
2,3,Michael,Williams,mwilliams@email.com,555-0103,789 Pine Rd,Chicago,USA,2023-03-10
3,4,Sarah,Brown,sarah.b@email.com,555-0104,321 Elm St,Houston,USA,2023-04-05
4,5,David,Jones,djones@email.com,555-0105,654 Maple Dr,Phoenix,USA,2023-05-12

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT * 
FROM categories
""")

---

## Question 2: SELECT Specific Columns

**Show only the `first_name` and `email` of all customers.**

üí° **Hint:** Use `SELECT column1, column2 FROM table_name`

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT first_name, email 
FROM customers
""")

---

## Question 3: Using WHERE (Filter Data)

**Find all products that cost more than $100.**

üí° **Hint:** Use `WHERE column > value`

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT * 
FROM products
WHERE price > 100
""")

---

## Question 4: Using WHERE with Text

**Find all customers who live in "New York".**

üí° **Hint:** Use `WHERE column = 'text'` (use single quotes for text)

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT * 
FROM customers
WHERE city = 'New York'
""")

---

## Question 5: ORDER BY (Sorting)

**Show all products sorted by price from lowest to highest.**

üí° **Hint:** Use `ORDER BY column ASC` (ASC = ascending = low to high)

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT * 
FROM products
ORDER BY price ASC
""")

---

## Question 6: ORDER BY DESC (Reverse Sorting)

**Show all products sorted by price from highest to lowest.**

üí° **Hint:** Use `ORDER BY column DESC` (DESC = descending = high to low)

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT * 
FROM products
ORDER BY price DESC
""")

---

## Question 7: LIMIT (Show Only Some Rows)

**Show the 3 most expensive products.**

üí° **Hint:** Sort by price DESC, then use `LIMIT 3`

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT * 
FROM products
ORDER BY price DESC
LIMIT 3
""")

---

## Question 8: COUNT (How Many?)

**Count how many customers are in the database.**

üí° **Hint:** Use `SELECT COUNT(*) FROM table_name`

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT COUNT(*) AS total_customers
FROM customers
""")

---

## Question 9: SUM (Add Up Values)

**Find the total amount of all completed orders.**

üí° **Hint:** Use `SUM(column)` and `WHERE status = 'completed'`

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT SUM(total_amount) AS total_revenue
FROM orders
WHERE status = 'completed'
""")

---

## Question 10: AVG (Average Value)

**Find the average price of all products.**

üí° **Hint:** Use `AVG(column)`

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT AVG(price) AS average_price
FROM products
""")

---

## Question 11: GROUP BY (Count by Category)

**Count how many orders have each status (completed, pending, etc.).**

üí° **Hint:** Use `GROUP BY column` with `COUNT(*)`

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT status, COUNT(*) AS order_count
FROM orders
GROUP BY status
""")

---

## Question 12: Simple JOIN (Combine Tables)

**Show order details with customer names. Display: order_id, first_name, last_name, total_amount.**

üí° **Hint:** Use `JOIN table2 ON table1.column = table2.column`

In [ ]:
# YOUR CODE HERE
run_query("""

""")

In [ ]:
# ‚úÖ SOLUTION
run_query("""
SELECT o.order_id, c.first_name, c.last_name, o.total_amount
FROM orders o
JOIN customers c ON o.customer_id = c.customer_id
LIMIT 10
""")

---

# üéâ Congratulations!

You've completed the beginner SQL practice! Here's what you learned:

| Skill | SQL Keyword |
|-------|-------------|
| Get all data | `SELECT * FROM table` |
| Get specific columns | `SELECT col1, col2` |
| Filter data | `WHERE condition` |
| Sort results | `ORDER BY column` |
| Limit results | `LIMIT number` |
| Count rows | `COUNT(*)` |
| Sum values | `SUM(column)` |
| Average values | `AVG(column)` |
| Group data | `GROUP BY column` |
| Combine tables | `JOIN` |

---

## üìö SQL Cheat Sheet

```sql
-- Get all data from a table
SELECT * FROM table_name;

-- Get specific columns
SELECT column1, column2 FROM table_name;

-- Filter with WHERE
SELECT * FROM table_name WHERE condition;

-- Sort results
SELECT * FROM table_name ORDER BY column ASC;  -- low to high
SELECT * FROM table_name ORDER BY column DESC; -- high to low

-- Limit results
SELECT * FROM table_name LIMIT 5;

-- Count, Sum, Average
SELECT COUNT(*) FROM table_name;
SELECT SUM(column) FROM table_name;
SELECT AVG(column) FROM table_name;

-- Group by
SELECT column, COUNT(*) FROM table_name GROUP BY column;

-- Join tables
SELECT * FROM table1
JOIN table2 ON table1.id = table2.id;
```

In [ ]:
# Close connection when done
conn.close()
print("‚úÖ Database connection closed. Great job!")